mistyrain83/cc3200wifi/user/wifiapp/main.c
    }

    //No Mode Change Required
    if(lRetVal == ROLE_AP)
    {
        //waiting for the AP to acquire IP address from Internal DHCP Server
        // If the device is in AP mode, we need to wait for this event 
        // before doing anything 
        while(!IS_IP_ACQUIRED(g_ulStatus))
        {
        #ifndef SL_PLATFORM_MULTI_THREADED
            _SlNonOsMainLoopTask(); 
        #endif
        }
        //Stop Internal HTTP Server
        lRetVal = sl_NetAppStop(SL_NET_APP_HTTP_SERVER_ID);
        ASSERT_ON_ERROR( lRetVal);

        //Start Internal HTTP Server
        lRetVal = sl_NetAppStart(SL_NET_APP_HTTP_SERVER_ID);
        ASSERT_ON_ERROR( lRetVal);

       char cCount=0;
       
       //Blink LED 3 times to Indicate AP Mode
       for(cCount=0;cCount<3;cCount++)
       {
           //Turn RED LED On
           GPIO_IF_LedOn(MCU_RED_LED_GPIO);
           osi_Sleep(400);
           
           //Turn RED LED Off
           GPIO_IF_LedOff(MCU_RED_LED_GPIO);
           osi_Sleep(400);
       }

       char ssid[32];
	   unsigned short len = 32;
	   unsigned short config_opt = WLAN_AP_OPT_SSID;
	   sl_WlanGet(SL_WLAN_CFG_AP_ID, &config_opt , &len, (unsigned char* )ssid);
	   UART_PRINT("\n\r Connect to : \'%s\'\n\r\n\r",ssid);
    }
    else
    {
        //Stop Internal HTTP Server
        lRetVal = sl_NetAppStop(SL_NET_APP_HTTP_SERVER_ID);
        ASSERT_ON_ERROR( lRetVal);

        //Start Internal HTTP Server
        lRetVal = sl_NetAppStart(SL_NET_APP_HTTP_SERVER_ID);
        ASSERT_ON_ERROR( lRetVal);

    	//waiting for the device to Auto Connect
        while(uiConnectTimeoutCnt<AUTO_CONNECTION_TIMEOUT_COUNT &&
            ((!IS_CONNECTED(g_ulStatus)) || (!IS_IP_ACQUIRED(g_ulStatus)))) 
        {
            //Turn RED LED On
            GPIO_IF_LedOn(MCU_RED_LED_GPIO);
            osi_Sleep(50);
            
            //Turn RED LED Off
            GPIO_IF_LedOff(MCU_RED_LED_GPIO);
            osi_Sleep(50);
            
            uiConnectTimeoutCnt++;
        }
        //Couldn't connect Using Auto Profile
        if(uiConnectTimeoutCnt == AUTO_CONNECTION_TIMEOUT_COUNT)
        {
            //Blink Red LED to Indicate Connection Error
            g_ucLEDStatus = LED_ON;
            //GPIO_IF_LedOn(MCU_RED_LED_GPIO);
            
            CLR_STATUS_BIT_ALL(g_ulStatus);

            //Connect Using Smart Config
            lRetVal = SmartConfigConnect();
            ASSERT_ON_ERROR(lRetVal);

            //Waiting for the device to Auto Connect
            while((!IS_CONNECTED(g_ulStatus)) || (!IS_IP_ACQUIRED(g_ulStatus)))
            {
                MAP_UtilsDelay(500);              
            }
    }
    //Turn RED LED Off
    g_ucLEDStatus = LED_OFF;
    //GPIO_IF_LedOff(MCU_RED_LED_GPIO);

    //g_iInternetAccess = ConnectionTest();

    }
    return SUCCESS;
}


//****************************************************************************
//
//!    \brief Read Force AP GPIO and Configure Mode - 1(Access Point Mode)
//!                                                  - 0 (Station Mode)
//!
//! \return                        None
//
//****************************************************************************
static void ReadDeviceConfiguration()
{
    unsigned int uiGPIOPort;
    unsigned char pucGPIOPin;
    unsigned char ucPinValue;
        
    //Read GPIO
    GPIO_IF_GetPortNPin(SH_GPIO_3,&uiGPIOPort,&pucGPIOPin);
    ucPinValue = GPIO_IF_Get(SH_GPIO_3,uiGPIOPort,pucGPIOPin);
        
    //If Connected to VCC, Mode is AP
    if(ucPinValue == 1)
    {
        //AP Mode
        g_uiDeviceModeConfig = ROLE_AP;
    }
    else
    {
        //STA Mode
        g_uiDeviceModeConfig = ROLE_STA;
    }

}

//****************************************************************************
//
//!    \brief OOB Application Main Task - Initializes SimpleLink Driver and
//!                                              Handles HTTP Requests
//! \param[in]                  pvParameters is the data passed to the Task
//!
//! \return                        None
//
//****************************************************************************
static void OOBTask(void *pvParameters)
{
    long   lRetVal = -1;

    //Read Device Mode Configuration
    ReadDeviceConfiguration();

    //Connect to Network
    lRetVal = ConnectToNetwork();
    if(lRetVal < 0)
    {
        ERR_PRINT(lRetVal);
        LOOP_FOREVER();
    }
	
if(ReadFileFromDevice("config.txt", g_cServerIP, g_cServerPort) < 0)
    {
        GPIO_IF_LedOn(MCU_RED_LED_GPIO);
         LOOP_FOREVER();
    }


    while(FAILURE == g_iConfigOK)
    {
    #ifndef SL_PLATFORM_MULTI_THREADED
        _SlNonOsMainLoopTask(); 
    #endif
    }
      UART_PRINT("before create socket task\n");
	  lRetVal = osi_TaskCreate(TcpRecvTask, (signed char*)"TcpRecvTask", \
                            TCPRECV_STACK_SIZE, NULL, \
                            TCPRECV_TASK_PRIORITY, NULL );
							
	if(lRetVal < 0)
	{
		ERR_PRINT(lRetVal);
		LOOP_FOREVER();
	}
		

    //Handle Async Events
    while(1)
    {
        //LED Actions
        if(g_ucLEDStatus == LED_ON)
        {
            GPIO_IF_LedOn(MCU_RED_LED_GPIO);
            osi_Sleep(500);
        }
        if(g_ucLEDStatus == LED_OFF)
        {
            GPIO_IF_LedOff(MCU_RED_LED_GPIO);
            osi_Sleep(500);
        }
        if(g_ucLEDStatus==LED_BLINK)
        {
            GPIO_IF_LedOn(MCU_RED_LED_GPIO);
            osi_Sleep(500);
            GPIO_IF_LedOff(MCU_RED_LED_GPIO);
            osi_Sleep(500);
        }
		if(g_iSaveFlag == SUCCESS)
		{
			g_iSaveFlag = FAILURE;
			if(WriteFileToDevice("config.txt", g_cServerIP, g_cServerPort) < 0)
		   {
			   
			   LOOP_FOREVER();
		   }
		}
    }
}

static void TcpTask(void *pvParameters)
{
  long   lRetVal = -1;
  int             iCounter;
  int             iStatus;
	short           sTestBufLen = 0;
	UART_PRINT("in socket task\n");
	// filling the buffer
    for (iCounter=0 ; iCounter<BUF_SIZE ; iCounter++)
    {
        g_cBsdBuf[iCounter] = (char)(iCounter);
    }

    //sTestBufLen  = BUF_SIZE;
	
	
	
    //Handle Async Events
    while(1)
    {
		g_cBsdBuf[0] = 0x10;
		g_cBsdBuf[1] = 0x01;
		g_cBsdBuf[2] = 0x20;
		g_cBsdBuf[3] = 0x01;
		g_cBsdBuf[4] = GPIO_IF_LedStatus(MCU_RED_LED_GPIO);
		g_cBsdBuf[5] = 0x00;
		sTestBufLen = 6;
        // sending packet
        iStatus = sl_Send(g_iTcpSocketID, g_cBsdBuf, sTestBufLen, 0 );
        if( iStatus <= 0 )
        {
          sl_Close(g_iTcpSocketID);
            // error
          ERR_PRINT(iStatus);
			LOOP_FOREVER();
        }
		osi_Sleep(3000);
    }
}

static void TcpRecvTask(void *pvParameters)
{
	int i;
        long   lRetVal = -1;
  int             iCounter;
  int             iStatus;
	short           sTestBufLen;
	UART_PRINT("in socket recv task\n");
	// filling the buffer
    for (iCounter=0 ; iCounter<BUF_RECV_SIZE ; iCounter++)
    {
        g_cBsdRecvBuf[iCounter] = (char)(0);
    }

    sTestBufLen  = BUF_RECV_SIZE;
	
	
	
	g_iTcpSocketID = BsdTcpClient(g_uiServerIP, g_usServerPort);
	
	lRetVal = osi_TaskCreate(TcpTask, (signed char*)"TcpTask", \
                                TCP_STACK_SIZE, NULL, \
                                TCP_TASK_PRIORITY, NULL );
								
		if(lRetVal < 0)
		{
			ERR_PRINT(lRetVal);
			LOOP_FOREVER();
		} 
	
    //Handle Async Events
    while(1)
    {
        // sending packet
        iStatus = sl_Recv(g_iTcpSocketID, g_cBsdRecvBuf, sTestBufLen, 0 );
		UART_PRINT("recv len = %d\n", iStatus);
        if( iStatus <= 0 )
        {
          sl_Close(g_iTcpSocketID);
            // error
          ERR_PRINT(iStatus);
			if(0 == iStatus)
			{
				UART_PRINT("[WARN] Server Closed! Should Re-connect\n");
			}
			LOOP_FOREVER();
        }
		for(i = 0; i < iStatus; i++)
		{
			UART_PRINT("0x%x\n", g_cBsdRecvBuf[i]);
		}
		// parse receive buf
		if((g_cBsdRecvBuf[0] == 0x20) && (g_cBsdRecvBuf[1] == 1))
		{
			// DO
			if(g_cBsdRecvBuf[2] == 0x20)
			{
				switch(g_cBsdRecvBuf[4])
				{
					case 0x00:
						g_ucLEDStatus = LED_OFF;
						break;
					case 0x01:
						g_ucLEDStatus = LED_ON;
						break;
					case 0x02:
						g_ucLEDStatus = LED_BLINK;
						break;
					default:
						break;
				}
			}
			else
			{
				UART_PRINT("[WARN] Not DO!\n");
			}
		}
		else
		{
			UART_PRINT("Received Type or Version error!\n");
		}
    }
}

//****************************************************************************
//
//!    \brief LED Task - Process LED Status
//! \param[in]                  pvParameters is the data passed to the Task
//!
//! \return                        None
//
//****************************************************************************
static void LEDTask(void *pvParameters)
{
    //Handle Async Events
    while(1)
    {
        //LED Actions
        if(g_ucLEDStatus == LED_ON)
        {
            GPIO_IF_LedOn(MCU_RED_LED_GPIO);
            osi_Sleep(500);
        }
        if(g_ucLEDStatus == LED_OFF)
        {
            GPIO_IF_LedOff(MCU_RED_LED_GPIO);
            osi_Sleep(500);
        }
        if(g_ucLEDStatus==LED_BLINK)
        {
            GPIO_IF_LedOn(MCU_RED_LED_GPIO);
            osi_Sleep(500);
            GPIO_IF_LedOff(MCU_RED_LED_GPIO);
            osi_Sleep(500);
        }
    }
}

